In [1]:
import pandas as pd
import numpy as np
import json
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
!ls

maha.ipynb	  Restaurant_Inspection_Scores.csv
maha_trump.ipynb  restaurant_score_feb15.ipynb

In [3]:
df = pd.read_csv('./Restaurant_Inspection_Scores.csv')

In [5]:
df.head()

,Restaurant Name,Zip Code,Inspection Date,Score,Address,Facility ID,Process Description
0,New India Cuisine,78704,02/24/2016,89,"2304 S CONGRESS AVE\nAUSTIN, TX 78704\n(30.239...",11028089,1st Follow Up to Routine of 50 - 69
1,Nordstrom's E- Bar,78746,06/21/2016,96,"2901 S CAPITAL OF TEXAS HWY NB\nAUSTIN, TX 787...",2801828,Routine Inspection
2,North by Northwest Parkside,78749,05/02/2016,80,"5701 W SLAUGHTER LN\nAUSTIN, TX 78749\n(30.201...",11187773,Routine Inspection
3,Olive Garden #1046,78704,11/01/2017,88,"3940 S LAMAR BLVD SB\nAUSTIN, TX 78704\n(30.23...",11441900,Routine Inspection
4,Pacha,78756,03/10/2015,87,"4618 BURNET RD\nAUSTIN, TX 78756\n(30.317286, ...",10213212,Routine Inspection

In [6]:
# Print the shape of df
print(df.shape)

(25112, 7)

In [8]:
# Print the info of df
df.isnull().sum()

Restaurant Name        0
Zip Code               0
Inspection Date        0
Score                  0
Address                0
Facility ID            0
Process Description    0
dtype: int64

In [9]:
df.drop(['Address', 'Facility ID', 'Process Description'], axis=1, inplace=True)
df.head()

               Restaurant Name Zip Code Inspection Date  Score
0            New India Cuisine    78704      02/24/2016     89
1           Nordstrom's E- Bar    78746      06/21/2016     96
2  North by Northwest Parkside    78749      05/02/2016     80
3           Olive Garden #1046    78704      11/01/2017     88
4                        Pacha    78756      03/10/2015     87

In [10]:
# replace all spaces with underscores in the column names by using the 'str.replace' method
df.columns = df.columns.str.replace(' ', '_')
df.columns

Index(['Restaurant_Name', 'Zip_Code', 'Inspection_Date', 'Score'], dtype='object')

In [11]:
df.sort_values(['Score', 'Inspection_Date'], ascending=False).head()

                       Restaurant_Name Zip_Code Inspection_Date  Score
4840               South Austin Senior    78704      12/31/2015    100
6363      Target (Food Service) T-1061    78749      12/30/2016    100
6962             Target Store   T-1061    78749      12/30/2016    100
7173  Trinity Child Development Center    78723      12/30/2016    100
2677                 Black Walnut Cafe    78730      12/30/2015    100

In [12]:
df.dtypes

Restaurant_Name    object
Zip_Code           object
Inspection_Date    object
Score               int64
dtype: object

In [14]:
from bokeh.plotting import figure
from bokeh.io import output_file, show

In [18]:
# restaurants with a score greater than 85
df[ df['Score'] > 85 ][['Restaurant_Name']].head(3)

      Restaurant_Name
0   New India Cuisine
1  Nordstrom's E- Bar
3  Olive Garden #1046

In [19]:
# restaurants with a score less than than 70
df[ df['Score'] < 70 ][['Restaurant_Name']].head(3)

              Restaurant_Name
128  Onion Creek Country Club
257               Omni Austin
819         New India Cuisine

### More info on mapping utilities

https://bokeh.pydata.org/en/latest/docs/user_guide/geo.html

https://github.com/pbugnion/gmaps

https://bl.ocks.org/mbostock/4060606